content/posts/variational_inference.md
+++
title = "variational inference"
author = ["Cameron Smith"]
lastmod = 2020-09-20T18:12:22-04:00
slug = "variational_inference"
draft = false
+++

## [probabilistic inference]({{< relref "probabilistic_inference" >}}), [algorithms]({{< relref "algorithms" >}}) {#probabilistic-inference--probabilistic-inference-dot-md--algorithms--algorithms-dot-md}


## relationship to the [free energy principle]({{< relref "free_energy_principle" >}}) {#relationship-to-the-free-energy-principle--free-energy-principle-dot-md}


### "At the core of the background necessary to understand the [free energy principle]({{< relref "free_energy_principle" >}}) is the relationship between free energy as it is used in [statistical physics]({{< relref "statistical_physics" >}}) versus its use in [probabilistic inference]({{< relref "probabilistic_inference" >}}) which is encapsulated in the notion of [variational inference]({{< relref "variational_inference" >}}). The best explanation I know of this relationship is in the formulation of Gibbs free energy via a variational principle in [Information, physics, and computation by Marc Mezard and Andrea Montanari in 2009]({{< relref "Information,_physics,_and_computation_by_Marc_Mezard_and_Andrea_Montanari_in_2009" >}})." {#at-the-core-of-the-background-necessary-to-understand-the-free-energy-principle--free-energy-principle-dot-md--is-the-relationship-between-free-energy-as-it-is-used-in-statistical-physics--statistical-physics-dot-md--versus-its-use-in-probabilistic-inference--probabilistic-inference-dot-md--which-is-encapsulated-in-the-notion-of-variational-inference--variational-inference-dot-md--dot-the-best-explanation-i-know-of-this-relationship-is-in-the-formulation-of-gibbs-free-energy-via-a-variational-principle-in-information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009--information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009-dot-md--dot}


## books {#books}


### see "10. Approximate inference" in [Pattern recognition and machine learning by Chris Bishop in 2006]({{< relref "Pattern_recognition_and_machine_learning_by_Chris_Bishop_in_2006" >}}) {#see-10-dot-approximate-inference-in-pattern-recognition-and-machine-learning-by-chris-bishop-in-2006--pattern-recognition-and-machine-learning-by-chris-bishop-in-2006-dot-md}


## papers {#papers}


### [The Helmholtz Machine by Peter Dayan, Geoffrey Hinton, Radford Neal, and Richard Zemel in 1995]({{< relref "The_Helmholtz_Machine_by_Peter_Dayan,_Geoffrey_Hinton,_Radford_Neal,_and_Richard_Zemel_in_1995" >}}) {#the-helmholtz-machine-by-peter-dayan-geoffrey-hinton-radford-neal-and-richard-zemel-in-1995--the-helmholtz-machine-by-peter-dayan-geoffrey-hinton-radford-neal-and-richard-zemel-in-1995-dot-md}


### [Information, physics, and computation by Marc Mezard and Andrea Montanari in 2009]({{< relref "Information,_physics,_and_computation_by_Marc_Mezard_and_Andrea_Montanari_in_2009" >}}) {#information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009--information-physics-and-computation-by-marc-mezard-and-andrea-montanari-in-2009-dot-md}


### [Automatic Differentiation Variational Inference by Dustin Tran, Andrew Gelman, David Blei et al in 2016]({{< relref "Automatic_Differentiation_Variational_Inference_by_Dustin_Tran,_Andrew_Gelman,_David_Blei_et_al_in_2016" >}}) {#automatic-differentiation-variational-inference-by-dustin-tran-andrew-gelman-david-blei-et-al-in-2016--automatic-differentiation-variational-inference-by-dustin-tran-andrew-gelman-david-blei-et-al-in-2016-dot-md}


### [Variational inference a review for statisticians by David Blei et al in 2017]({{< relref "Variational_inference_a_review_for_statisticians_by_David_Blei_et_al_in_2017" >}}) {#variational-inference-a-review-for-statisticians-by-david-blei-et-al-in-2017--variational-inference-a-review-for-statisticians-by-david-blei-et-al-in-2017-dot-md}


### [A free energy principle for a particular physics by Karl Friston in 2019]({{< relref "A_free_energy_principle_for_a_particular_physics_by_Karl_Friston_in_2019" >}}) {#a-free-energy-principle-for-a-particular-physics-by-karl-friston-in-2019--a-free-energy-principle-for-a-particular-physics-by-karl-friston-in-2019-dot-md}


## software {#software}


### [pyro]({{< relref "pyro" >}}) including [Du Phan's implementation of Statistical rethinking in pyro]({{< relref "Du_Phan's_implementation_of_Statistical_rethinking_in_pyro" >}}) {#pyro--pyro-dot-md--including-du-phan-s-implementation-of-statistical-rethinking-in-pyro--du-phan-s-implementation-of-statistical-rethinking-in-pyro-dot-md}


## [lectures]({{< relref "lectures" >}}) {#lectures--lectures-dot-md}


### [Russ Salakhutdinov's lectures on Large Scale Machine Learning]({{< relref "Russ_Salakhutdinov's_lectures_on_Large_Scale_Machine_Learning" >}}) {#russ-salakhutdinov-s-lectures-on-large-scale-machine-learning--russ-salakhutdinov-s-lectures-on-large-scale-machine-learning-dot-md}


### [Variational inference by Chieh Wu in 2015]({{< relref "Variational_inference_by_Chieh_Wu_in_2015" >}}) {#variational-inference-by-chieh-wu-in-2015--variational-inference-by-chieh-wu-in-2015-dot-md}


### [Austin Rochford | Variational Inference in Python \* YouTube](<https://www.youtube.com/watch?v=3KGZDC3-%5FiY&t=197s>) {#austin-rochford-variational-inference-in-python-youtube--https-www-dot-youtube-dot-com-watch-v-3kgzdc3-iy-and-t-197s}
